EDT/УТ/src/Documents/УстановкаСтатусаОборудования/УстановкаСтатусаОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСтатусаОборудования</name>
  <registerRecords>AccumulationRegister.УчетОстатковОборудования</registerRecords>
  <registerRecords>InformationRegister.СтатусыОборудования</registerRecords>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОборудования</name>
    <type>
      <types>EnumRef.СтатусыЕдиницыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокОборудования</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/СтатусыОборудования/СтатусыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыОборудования</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусОборудования</name>
    <type>
      <types>EnumRef.СтатусыЕдиницыОборудования</types>
    </type>
  </resources>
  <resources>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/УстановкаСтатусаОборудования/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.СтатусыОборудования.Записывать = Истина;
	Движения.СтатусыОборудования.Очистить();
	Для Каждого ТекСтрокаСписокОборудования Из СписокОборудования Цикл
		Движение = Движения.СтатусыОборудования.Добавить();
		Движение.Период = Дата;
		Движение.Оборудование = ТекСтрокаСписокОборудования.Оборудование;
		Движение.СтатусОборудования = СтатусОборудования;
		Движение.Пользователь = Пользователь;
		Движение.Регион = Регион;
	КонецЦикла;

КонецПроцедуры
